:PROPERTIES:
:ID:       492ca0ad-ca58-46ec-a3ff-3dc10712dc1f
:END:
#+TITLE: Vyos: SSH Algorithms
#+CATEGORY: slips
#+TAGS:

do not use tables with shell in org babel (often, it's an anti-pattern to reach
for shell anyways when python & anylang are available)

** Babel
This differs a bit from what's listed

#+name: sshAlgs
#+begin_src shell :var algType="ciphers" :eval query
ssh vyostest ssh -Q $algType | tr "\n" "," | sed -E "s/([^,]+),([^,]+),([^,]+),([^,]+),/\1, \2, \3, \4\n/g" && echo
#+end_src

#+name: diffLists
#+begin_src shell :results output code :wrap example diff :var list1=sshCiphersListed algType="ciphers"
# list2=sshCiphers
diff <(echo ${list1[@]} | tr ' ' '\n' | sort | uniq) \
    <(ssh vyostest ssh -Q $algType | tr ' ' '\n' | sort | uniq)

# babel bug
#    <(echo ${list2[@]} | tr ' ' '\n' | sort | uniq)
#+end_src

#+RESULTS: diffLists
#+begin_example diff
3a4
> aes128-gcm@openssh.com
8,12c9,10
< arcfour
< arcfour128
< arcfour256
< blowfish-cbc
< cast128-cbc
---
> aes256-gcm@openssh.com
> chacha20-poly1305@openssh.com
#+end_example

Not all of the =-Q= arg types are documented, but this seems to cover the keys

#+begin_src shell :results output verbatim
echo -Qkey-{plain,sig,cert}
echo -Qkey-{plain,sig,cert} | xargs -n1 ssh | sort | uniq | wc -l
echo -Qpubkeyacceptedkeytypes
ssh -Qpubkeyacceptedkeytypes | wc -l

# no diff
diff <(echo -Qkey-{plain,sig,cert} | xargs -n1 ssh | sort | uniq) \
    <(ssh -Q pubkeyacceptedkeytypes | sort | uniq)
#+end_src

#+RESULTS:
: -Qkey-plain -Qkey-sig -Qkey-cert
: 19
: -Qpubkeyacceptedkeytypes
: 19

[[https://raw.githubusercontent.com/dfeich/org-babel-examples/refs/heads/master/shell/shell-babel.org][Babel bugs in tables, but only with shell]]......

#+begin_src shell :results output verbatim :var list1=sshCiphersListed list2=sshCiphers
# list2=sshCiphers
for cipher in ${list1[@]}; do
    echo $cipher
done

# produces 8 entries somehow (it completely drops the first column)
#+end_src

#+RESULTS:
: arcfour128
: arcfour256
: blowfish-cbc
: cast128-cbc
: aes192-ctr
: aes256-ctr
: aes192-cbc
: aes256-cbc

#+ call: diffLists(list1=sshCiphersListed, list2=sshCiphers)

#+ call: diffLists(list1=sshMacsListed, list2=sshMacs)

#+ call: diffLists(list1=sshKexListed, list2=sshKex)

#+ call: diffLists(list1=sshPubkeyListed, list2=sshPubkey)
